{
  "project": "Toolkit Website",
  "branchName": "feature/getting-started-rewrite",
  "description": "Rewrite the Getting Started page from scratch around the correct, complete, terminal-based workflow: install opencode via curl, connect GitHub Copilot as the provider, install the yo, go toolkit, navigate to a project directory, launch opencode, and invoke an agent. Introduces a sticky step-tracker sidebar component.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Rewrite the top-level install step",
      "description": "As a user coming to this page for the first time, I want clear, copyable instructions for installing opencode in my terminal so I can get it running without any guesswork.",
      "acceptanceCriteria": [
        "Step 1 is titled 'Install opencode'",
        "Step 1 shows the curl install command in a copyable code block using the existing CopyButton component",
        "A brief plain-language note explains what the command does: 'This downloads and installs opencode — a terminal-based AI coding tool — onto your computer'",
        "A secondary note covers macOS users who may need to open a new terminal window after install for the opencode command to be available",
        "No mention of downloading a desktop app anywhere on the page",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser"
      ],
      "priority": 1,
      "passes": false,
      "notes": "",
      "documentationRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": false,
      "e2eScope": null,
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-002",
      "title": "Add provider setup step (GitHub Copilot)",
      "description": "As a new user, I want clear instructions for connecting a provider so opencode can actually talk to an AI model.",
      "acceptanceCriteria": [
        "Step 2 is titled 'Connect a provider'",
        "The step recommends GitHub Copilot Pro+ with a direct link to https://github.com/features/copilot/plans",
        "Plain-language explanation: 'A provider is the AI service that powers opencode. Think of it like connecting opencode to a brain.'",
        "Instructions tell the user to first launch opencode in their terminal: run 'opencode' (with copyable code block)",
        "Instructions show the exact /connect command to type inside opencode (copyable)",
        "A rendered terminal-style UI mockup shows what the provider selection prompt looks like, with 'GitHub Copilot' highlighted",
        "Instructions explain the device auth step: opencode will display a URL and a code; go to github.com/login/device, enter the code, and authorize",
        "A rendered terminal-style UI mockup shows the device auth prompt (URL + code + 'Waiting for authorization...')",
        "Instructions note: after connecting, type /models to verify models are available, then /exit to quit opencode",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser"
      ],
      "priority": 2,
      "passes": false,
      "notes": "",
      "documentationRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": false,
      "e2eScope": null,
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-003",
      "title": "Add yo, go toolkit install step",
      "description": "As a user who now has opencode running, I want clear instructions to install the yo, go agent toolkit so the agents (Planner, Builder, etc.) are available.",
      "acceptanceCriteria": [
        "Step 3 is titled 'Install the yo, go toolkit'",
        "Plain-language explanation: 'This installs the agents, skills, and project templates that make opencode work for structured software development'",
        "The install command is shown in a copyable code block using getInstallCommand()",
        "A note explains what gets installed and where: agents, skills, and scaffolds go into ~/.config/opencode/",
        "The existing interactive-install note is preserved (about /dev/tty and CI environments defaulting to n)",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser"
      ],
      "priority": 3,
      "passes": false,
      "notes": "",
      "documentationRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": false,
      "e2eScope": null,
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-004",
      "title": "Add 'navigate to your project' step",
      "description": "As a user ready to start coding, I need a step that tells me to navigate to my project directory before launching opencode, because opencode runs in the context of whatever directory I'm in.",
      "acceptanceCriteria": [
        "Step 4 is titled 'Go to your project folder'",
        "Plain-language explanation: 'opencode works inside your project. You need to point your terminal at the folder you want to work on.'",
        "Shows a copyable cd command example: 'cd path/to/your-project' with a note that the user should replace this with their actual folder path",
        "For users who don't have a project yet: a callout note says 'Starting from scratch? You can also create a new project — the Planner agent will walk you through it. Just navigate to any empty folder: mkdir my-project && cd my-project' — shown as a copyable compound command",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser"
      ],
      "priority": 4,
      "passes": false,
      "notes": "",
      "documentationRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": false,
      "e2eScope": null,
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-005",
      "title": "Add 'launch opencode and start an agent' step",
      "description": "As a user in my project directory, I want exact instructions for launching opencode and starting a conversation with an agent, including what to type.",
      "acceptanceCriteria": [
        "Step 5 is titled 'Launch opencode'",
        "Shows the opencode launch command in a copyable code block",
        "A rendered terminal-style mockup shows the opencode TUI prompt after launch",
        "Explains that agents are invoked by typing their name with @ in the prompt, e.g. @planner or @builder",
        "Shows three practical starter prompts users can try, each in a copyable format: @planner, @builder, @coder — with brief descriptions of when to use each",
        "A note explains what happens next: the agent will immediately ask you to select or register a project",
        "Shows the project selection prompt mockup (same as currently on the page)",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser"
      ],
      "priority": 5,
      "passes": false,
      "notes": "",
      "documentationRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": false,
      "e2eScope": null,
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-006",
      "title": "Implement sticky step-tracker sidebar",
      "description": "As a user following a multi-step guide, I want a persistent sidebar or progress indicator that shows all steps and highlights which step is currently visible on screen, so I always know where I am in the process without scrolling back to the top.",
      "acceptanceCriteria": [
        "On desktop (md+ breakpoint), a sticky sidebar shows all steps as a vertical list with numbers and titles: 1. Install opencode, 2. Connect a provider, 3. Install the toolkit, 4. Go to your project folder, 5. Launch opencode",
        "The active step is visually highlighted using Intersection Observer to detect which step is currently in view",
        "Completed steps (above the current viewport) show a distinct 'done' visual state",
        "Clicking a step in the sidebar scrolls to that step on the page",
        "On mobile (below md breakpoint), the sidebar is hidden; instead, a compact 'Step X of 5' pill appears fixed at the top or bottom of the screen",
        "The step-tracker uses the existing design system (Tailwind classes, dark mode aware)",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser — confirm step highlighting updates correctly as the user scrolls in both light and dark mode"
      ],
      "priority": 6,
      "passes": false,
      "notes": "",
      "documentationRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": false,
      "e2eScope": null,
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-007",
      "title": "Retain and clean up post-setup content",
      "description": "As a user who has completed setup, I want the 'Starting Your First Project', 'Project Structure', 'Key Agents to Know', and 'Learn More' sections to remain on the page but be cleaned up and repositioned as a natural continuation after the 5 install steps.",
      "acceptanceCriteria": [
        "A visual divider and section heading ('After Setup') separates the 5 install steps from the post-setup content",
        "'Starting Your First Project' removes the first sub-step ('Open opencode and select a primary agent') since that is now covered in Step 5",
        "The remaining sub-steps in 'Starting Your First Project' are renumbered correctly",
        "'Project Structure After Setup' is unchanged",
        "'Key Agents to Know' does not reference @e2e-tester (should reference @e2e-reviewer)",
        "'Learn More' section is unchanged",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser"
      ],
      "priority": 7,
      "passes": false,
      "notes": "",
      "documentationRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": false,
      "e2eScope": null,
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    }
  ]
}
