{
  "project": "Toolkit Website",
  "branchName": "feature/toolkit-sync-update",
  "description": "Update website content to match current toolkit state, with focus on documenting the testing system architecture",
  "userStories": [
    {
      "id": "US-001",
      "title": "Update Testing Architecture Overview",
      "description": "As a visitor, I want to understand how the testing system is organized so I can use the right agent for my testing needs.",
      "acceptanceCriteria": [
        "Create a 'Testing System' section on the concepts page explaining the architecture",
        "Document the three tester modes: Story Mode, Ad-hoc Mode, Full Suite Mode",
        "Show the hierarchy: tester orchestrator → specialist testers → QA system",
        "Include a visual diagram or structured list showing agent relationships",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser",
        "Works in both light and dark mode"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Testing System section already exists on concepts page with Testing Agent Hierarchy diagram (4 layers: orchestrator, unit specialists, E2E, QA), Three Operational Modes section (Story Mode, Ad-hoc Mode, Full Suite Mode), and complete architecture documentation. Links to #architecture anchor.",
      "supportArticleRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": true,
      "e2eScope": "testing concepts page renders correctly with new sections",
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-002",
      "title": "Document Tester Orchestrator Agent",
      "description": "As a visitor, I want to understand how the tester orchestrator works so I know when and how tests are automatically generated.",
      "acceptanceCriteria": [
        "Add detailed documentation for the 'tester' agent on the agents page",
        "Explain the three operational modes with examples: Story Mode, Ad-hoc Mode, Full Suite Mode",
        "Document the routing logic to specialist testers (jest-tester, react-tester, go-tester)",
        "Explain test loop handling (max 3 attempts, then defer)",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser",
        "Works in both light and dark mode"
      ],
      "priority": 2,
      "passes": true,
      "notes": "How the Tester Orchestrator Works section documents the 4-step orchestration process, routing logic table (file patterns to agents), and Test Loop & Retry Handling with visual diagram. Three Operational Modes section covers Story Mode, Ad-hoc Mode, Full Suite Mode with examples and 'When to use' guidance.",
      "supportArticleRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": true,
      "e2eScope": "tester agent documentation page displays correctly",
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-003",
      "title": "Document Unit Test Specialists",
      "description": "As a visitor, I want to understand the specialist testing agents so I know which one handles my stack.",
      "acceptanceCriteria": [
        "Document jest-tester: Backend JavaScript/TypeScript testing",
        "Document react-tester: React component testing with React Testing Library",
        "Document go-tester: Go testing with testify and httptest",
        "Explain how projects can override global testers with project-specific versions",
        "Show the file patterns each specialist handles",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser",
        "Works in both light and dark mode"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Added Unit Test Specialists section with detailed agent cards for jest-tester, react-tester, and go-tester. Includes file patterns, frameworks, key capabilities, and project override system documentation.",
      "supportArticleRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": true,
      "e2eScope": "unit test specialist agent pages render correctly",
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-004",
      "title": "Document E2E Testing Agents",
      "description": "As a visitor, I want to understand the E2E testing system so I can use it effectively for UI testing.",
      "acceptanceCriteria": [
        "Document e2e-playwright: Writes Playwright E2E tests for UI areas",
        "Document e2e-reviewer: Reviews UI changes and identifies areas needing E2E tests",
        "Document playwright-dev: Implements Playwright test automation tasks",
        "Document e2e-tester: Primary agent for running full E2E test suites",
        "Explain the workflow: reviewer identifies areas → playwright writes tests → tester runs them",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser",
        "Works in both light and dark mode"
      ],
      "priority": 4,
      "passes": true,
      "notes": "E2E Testing System section documents all 4 agents with detailed cards: e2e-reviewer (amber), e2e-playwright (purple), playwright-dev (indigo), e2e-tester (green). Includes E2E workflow diagram showing the complete flow from UI changes through Pass/Fail outcomes. Key concepts section covers e2e-areas.json and failure handling.",
      "supportArticleRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": true,
      "e2eScope": "E2E agent documentation pages render correctly",
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-005",
      "title": "Document QA Adversarial Testing System",
      "description": "As a visitor, I want to understand the QA system so I can use it to find bugs through exploratory testing.",
      "acceptanceCriteria": [
        "Document qa coordinator agent and its dispatch mechanism",
        "Document qa-explorer: Adversarial testing with browser-use CLI",
        "Document qa-browser-tester: Converting bug findings into Playwright tests",
        "Explain the flow: qa coordinates → explorer finds bugs → browser-tester creates regression tests",
        "Mention the browser-use CLI dependency and how it enables autonomous browsing",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser",
        "Works in both light and dark mode"
      ],
      "priority": 5,
      "passes": true,
      "notes": "QA & Adversarial Testing section documents all 3 agents with detailed cards: qa (orange), qa-explorer (red), qa-browser-tester (teal). Includes QA workflow diagram showing browser-use CLI for autonomous browsing, bug findings with screenshots and reproduction steps, and final regression tests output.",
      "supportArticleRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": true,
      "e2eScope": "QA system documentation pages render correctly",
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-006",
      "title": "Document E2E Quality Patterns Skill",
      "description": "As a visitor, I want to understand the E2E quality patterns so I can catch issues beyond basic correctness.",
      "acceptanceCriteria": [
        "Add the e2e-quality skill to the skills documentation",
        "Document each pattern with examples: assertNeverAppears, withPerformanceBudget, assertNoLayoutShift, assertStableRender, measureCLS, assertStateStability, expectMutualExclusivity",
        "Explain when to use quality patterns vs basic assertions",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser",
        "Works in both light and dark mode"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Added comprehensive E2E Quality Patterns section to testing concepts page. Documents all 7 patterns with code examples: assertNeverAppears, withPerformanceBudget, assertNoLayoutShift, assertStableRender, measureCLS, assertStateStability, expectMutualExclusivity. Includes guidance on when to use quality patterns vs basic assertions and link to full skill page.",
      "supportArticleRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": true,
      "e2eScope": "e2e-quality skill documentation renders with code examples",
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-007",
      "title": "Document Test Flow Skill",
      "description": "As a visitor, I want to understand the test flow automation so I know how tests are generated and managed during development.",
      "acceptanceCriteria": [
        "Add the test-flow skill to the skills documentation",
        "Document the automatic test generation triggers",
        "Explain the fix loop mechanism (attempt fixes up to 3 times)",
        "Document E2E deferral when tests cannot be fixed immediately",
        "Show how test flow integrates with the tester agent",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser",
        "Works in both light and dark mode"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Test Flow Automation section documents test-flow skill with indigo color theme. Includes Automatic Test Generation Triggers (PRD mode, Ad-hoc mode, Coverage gaps), Fix Loop Mechanism with visual diagram (Run → Test Pass? → Analyze Failures → Developer fixes → Retry ≤3 → Defer to E2E), E2E Deferral documentation, and tester agent integration.",
      "supportArticleRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": true,
      "e2eScope": "test-flow skill documentation renders correctly",
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-008",
      "title": "Add Mutation Testing Requirements Concept",
      "description": "As a visitor, I want to understand the mutation testing requirements so I write tests that properly verify state changes.",
      "acceptanceCriteria": [
        "Add a 'Mutation Testing' concept explaining the 3-step pattern",
        "Document the three verification stages: immediate state, stable state, persistence",
        "Provide code examples showing the pattern",
        "Explain why each stage is necessary",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser",
        "Works in both light and dark mode"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Added comprehensive Mutation Testing Pattern section to testing concepts page. Documents all three verification stages (Immediate State, Stable State, Persistence) with visual cards, code examples, and 'Why Each Stage Matters' explanations. Includes additional examples for delete and create operations. Uses sky/cyan color theme.",
      "supportArticleRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": true,
      "e2eScope": "mutation testing concept page renders with code examples",
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-009",
      "title": "Update Testers Category Page",
      "description": "As a visitor, I want the testers category page to accurately reflect all 10 testing agents with their relationships.",
      "acceptanceCriteria": [
        "Verify all 10 testers are listed with accurate descriptions",
        "Group testers by function: Orchestrator, Unit Specialists, E2E, QA",
        "Update category description to explain the testing system hierarchy",
        "Add cross-references between related agents (e.g., tester → jest-tester)",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser",
        "Works in both light and dark mode"
      ],
      "priority": 9,
      "passes": true,
      "notes": "Updated testers category page with grouped display by function (Orchestrator, Unit Specialists, E2E Testing, QA & Adversarial, Supporting). Added cross-references showing agent relationships. Updated category description to explain testing hierarchy. Added link to Testing Concepts page. Works in both light and dark mode.",
      "supportArticleRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": true,
      "e2eScope": "testers category page shows all 10 agents with groupings",
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-010",
      "title": "Update Concepts Navigation",
      "description": "As a visitor, I want to easily navigate to testing-related concepts from the main concepts page.",
      "acceptanceCriteria": [
        "Add 'Testing' section to concepts page with links to: Testing Architecture Overview, E2E Quality Patterns, Test Flow Automation, Mutation Testing Requirements",
        "Ensure consistent navigation structure with other concept sections",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser",
        "Works in both light and dark mode"
      ],
      "priority": 10,
      "passes": true,
      "notes": "Added Quick Links subsection to Testing System card on concepts page with direct anchor links to 4 testing sub-topics. Added Quick Navigation section at top of testing concepts page with colored icon links. Added IDs to architecture, test-flow, quality-patterns, and mutation-testing sections. Works in both light and dark mode with proper color theming.",
      "supportArticleRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": true,
      "e2eScope": "concepts page navigation shows Testing section with working links",
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    },
    {
      "id": "US-011",
      "title": "Verify Build-Time Sync Accuracy",
      "description": "As a developer, I want to verify the build-time sync correctly extracts all testing agents and skills.",
      "acceptanceCriteria": [
        "Run npm run sync and verify toolkit-manifest.json contains all 10 testers",
        "Verify both testing skills (test-flow, e2e-quality) are extracted",
        "Check that agent descriptions match current agent files",
        "Fix any discrepancies in the extraction script",
        "Typecheck passes",
        "Lint passes"
      ],
      "priority": 11,
      "passes": true,
      "notes": "Fixed extraction script categorization logic to properly classify E2E and QA agents as testers. Previously e2e-reviewer was categorized as 'critics' and playwright-dev as 'developers'. Added explicit checks for e2e-, qa-, and playwright-dev patterns. Also excluded merge-coordinator from testers category. Now correctly extracts all 10 testers and both testing skills (test-flow, e2e-quality).",
      "supportArticleRequired": false,
      "documentationType": null,
      "relatedArticleSlugs": [],
      "e2eRequired": false,
      "e2eScope": null,
      "marketingRequired": false,
      "marketingType": null,
      "relatedMarketingPages": [],
      "toolsRequired": false,
      "toolsType": null,
      "relatedToolNames": []
    }
  ]
}
